# Series

In [3]:
import pandas as pd
import numpy as np

In [11]:
labels=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,"b":20,"c":30} # key 代表 index

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(np.linspace(0.01,1,20))

0     0.010000
1     0.062105
2     0.114211
3     0.166316
4     0.218421
5     0.270526
6     0.322632
7     0.374737
8     0.426842
9     0.478947
10    0.531053
11    0.583158
12    0.635263
13    0.687368
14    0.739474
15    0.791579
16    0.843684
17    0.895789
18    0.947895
19    1.000000
dtype: float64

In [20]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [25]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [26]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [33]:
s1=pd.Series([1,2,3,4],["Germany","USA","Eng","Japan"])
s1

Germany    1
USA        2
Eng        3
Japan      4
dtype: int64

In [34]:
s2=pd.Series([1,2,5,4],["USA","Germany","Ha","Taiwan"])
s2

USA        1
Germany    2
Ha         5
Taiwan     4
dtype: int64

In [36]:
s1["Germany":"Eng"]

Germany    1
USA        2
Eng        3
dtype: int64

In [39]:
s2[0:2]

USA        1
Germany    2
dtype: int64

In [41]:
s3=pd.Series(labels)
s3

0    a
1    b
2    c
dtype: object

In [42]:
s3.loc[0]

'a'

In [54]:
#兩個Series 可以做operations ，如果其中一個找不到，就回傳None (會自動做match)
s1 + s2 # append Series

Eng        NaN
Germany    3.0
Ha         NaN
Japan      NaN
Taiwan     NaN
USA        3.0
dtype: float64

In [49]:
pd.concat((s1,s2))

Germany    1
USA        2
Eng        3
Japan      4
USA        1
Germany    2
Ha         5
Taiwan     4
dtype: int64

In [50]:
s1.append(s2)

Germany    1
USA        2
Eng        3
Japan      4
USA        1
Germany    2
Ha         5
Taiwan     4
dtype: int64

# DataFrame Part 1

In [58]:
from numpy.random import randn
np.random.seed(101)

In [59]:
df=pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [62]:
df.describe() # 敘述統計

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [71]:
type(df["W"])

pandas.core.series.Series

In [95]:
# get 不會出錯
df.get("New")

In [98]:
df["news"]=randn(5)

In [103]:
df.drop("news",axis=1,inplace=True)

In [104]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
df.drop("E",axis=0,inplace=True)

ValueError: labels ['E'] not contained in axis

In [108]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [109]:
df.shape

(4, 4)

In [110]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057

In [117]:
df.iloc[0:4]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [118]:
len(df)

4

In [120]:
#全部的元素
df.size

16

In [122]:
#呼叫敘述統計的東西
df.count()

W    4
X    4
Y    4
Z    4
dtype: int64

In [126]:
df.loc["C"]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [128]:
df.ix["B":,0:2]

          W         X
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872

# DataFrame part 2

In [131]:
#相當於是filter
mask1 = df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [133]:
# 不過不會自動縮減
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [135]:
df["W"] > 1

A     True
B    False
C    False
D    False
Name: W, dtype: bool

In [138]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [140]:
mask1 = df["W"]>0
df.get(mask1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [144]:
m=df["Z"] < 0
result=df[m]
result

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [150]:
result[["X","Z"]]

          X         Z
C  0.740122 -0.589001

In [154]:
df[df["W"]>0][["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237

In [160]:
mask1=df["W"]>0
mask2=df["Z"]<1
df[mask1 | mask2]

          W         X         Y         Z  News
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1

In [164]:
df.reset_index()

  index         W         X         Y         Z  News
0     A  2.706850  0.628133  0.907969  0.503826     1
1     B  0.651118 -0.319318 -0.848077  0.605965     1
2     C -2.018168  0.740122  0.528813 -0.589001     1
3     D  0.188695 -0.758872 -0.933237  0.955057     1

In [166]:
df

          W         X         Y         Z  News
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1

In [170]:
#return numpy value
type(df.values)

numpy.ndarray

In [173]:
newwind="CA NO RA RO".split(" ")
df["States"]=newwind

In [175]:
df.drop("News",axis=1)

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NO
C -2.018168  0.740122  0.528813 -0.589001     RA
D  0.188695 -0.758872 -0.933237  0.955057     RO

In [177]:
df.set_index(["States","X"])

                         W         Y         Z  News
States X
CA      0.628133  2.706850  0.907969  0.503826     1
NO     -0.319318  0.651118 -0.848077  0.605965     1
RA      0.740122 -2.018168  0.528813 -0.589001     1
RO     -0.758872  0.188695 -0.933237  0.955057     1

# DataFrame part3

In [200]:
# zip 將資料組成tuple ， *(zip object)，就是拆掉組合
outside=["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [187]:
list(zip(*hier_index))

[('G1', 'G1', 'G1', 'G2', 'G2', 'G3'), (1, 2, 3, 1, 2, 3)]

In [201]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [202]:
hier_index.to_frame()

       0  1
G1 1  G1  1
   2  G1  2
   3  G1  3
G2 1  G2  1
   2  G2  2
   3  G2  3

In [203]:
df=pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [205]:
df

             A         B
G1 1  1.322684  1.852155
   2 -0.892172  0.616861
   3 -1.121822  1.652070
G2 1  0.196925  0.103214
   2 -0.147370  1.131284
   3  1.085839  0.449486

In [209]:
df.loc["G1"].loc[1,"A"]

1.3226843661409005

In [214]:
#df,index.names 先命名外層的index，在命名內曾的index
df.index.names = ["Groups","Numbers"]

In [215]:
df

                       A         B
Groups Numbers
G1     1        1.322684  1.852155
       2       -0.892172  0.616861
       3       -1.121822  1.652070
G2     1        0.196925  0.103214
       2       -0.147370  1.131284
       3        1.085839  0.449486

In [216]:
df.index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['Groups', 'Numbers'])

In [217]:
df.loc["G2"]["B"][2]

1.131283662553862

In [224]:
df.xs(1,level="Numbers")

               A         B
Groups
G1      1.322684  1.852155
G2      0.196925  0.103214

In [225]:
df.xs("G1")

                A         B
Numbers
1        1.322684  1.852155
2       -0.892172  0.616861
3       -1.121822  1.652070

In [260]:
s=df.to_panel()
s

/Users/jiajiaping/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 2 (major_axis) x 3 (minor_axis)
Items axis: A to B
Major_axis axis: G1 to G2
Minor_axis axis: 1 to 3

In [259]:
s["A"]

Numbers         1         2         3
Groups
G1       1.322684 -0.892172 -1.121822
G2       0.196925 -0.147370  1.085839

In [258]:
s.major_xs("G1")

                A         B
Numbers
1        1.322684  1.852155
2       -0.892172  0.616861
3       -1.121822  1.652070

In [257]:
s.minor_xs(1)

               A         B
Groups
G1      1.322684  1.852155
G2      0.196925  0.103214

# Missing Data

In [277]:
# np.nan 空值
d={"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [281]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [285]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [286]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [290]:
# 可以故意多新增一欄，然後把那然當作是平均數
df["A"].fillna(df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBY

In [338]:
data={
    "company":["GOOG","GOOG","MSFT","MSFT","FB","FB"],
    "Person":["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
    "Sales":[200,120,340,124,243,350]
}

In [341]:
df=pd.DataFrame(data)
s=df["company"]
df

    Person  Sales company
0      Sam    200    GOOG
1  Charlie    120    GOOG
2      Amy    340    MSFT
3  Vanessa    124    MSFT
4     Carl    243      FB
5    Sarah    350      FB

In [343]:
s=df.copy()
s

    Person  Sales company
0      Sam    200    GOOG
1  Charlie    120    GOOG
2      Amy    340    MSFT
3  Vanessa    124    MSFT
4     Carl    243      FB
5    Sarah    350      FB

In [344]:
s.insert(0,"company1",df["company"],allow_duplicates=False)

In [346]:
s.drop("company",axis=1,inplace=True)

In [358]:
s.rename(columns={"company1":"company"},inplace=True)

In [359]:
s

  company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [375]:
s=s.groupby("company")

In [384]:
s.describe()
s.first()

        Person  Sales
company
FB        Carl    243
GOOG       Sam    200
MSFT       Amy    340

In [386]:
s.agg({"Sales":["sum","std"]})

        Sales
          sum         std
company
FB        593   75.660426
GOOG      320   56.568542
MSFT      464  152.735065

In [378]:
s.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [387]:
s.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [388]:
s.count()

         Person  Sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [389]:
s.max()

          Person  Sales
company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [393]:
s.describe().transpose()["FB"]

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# merging concating joining

In [396]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [405]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [406]:
pd.concat([df1,df2,df3],axis=1,ignore_index=True)

     0    1    2    3    4    5    6    7    8    9    10   11
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [407]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [424]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [425]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [420]:
left.merge(right,on=["key1"],how="outer")

    A   B key1 key2_x   C   D key2_y
0  A0  B0   K0     K0  C0  D0     K0
1  A1  B1   K0     K1  C0  D0     K0
2  A2  B2   K1     K0  C1  D1     K0
3  A2  B2   K1     K0  C2  D2     K0
4  A3  B3   K2     K1  C3  D3     K0

In [429]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [432]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [433]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Operations

In [434]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [436]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [441]:
#unique只能針對某一個欄位
df["col3"].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [443]:
df["col3"].nunique()

4

In [444]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [446]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [447]:
df["col2"].apply(lambda var:var+1)

0    445
1    556
2    667
3    445
Name: col2, dtype: int64

In [448]:
df["col2"]

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [449]:
def time2(row):
    return row*2

In [450]:
df.apply(time2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [452]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [453]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [456]:
df.drop('col1',axis=1,inplace=True)

ValueError: labels ['col1'] not contained in axis

In [458]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [459]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [461]:
df.sort_values("col2",ascending=True)

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [462]:
#isnull fillna dropna
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [465]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [471]:
df.pivot_table(values="D",index=["A","B"],columns=["C"],aggfunc="count")

C          x    y
A   B
bar one  1.0  1.0
    two  NaN  1.0
foo one  1.0  1.0
    two  1.0  NaN

In [469]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Data input and output
- CSV
- Excel
- HTML
- SQL

In [474]:
import html5lib
from bs4 import BeautifulSoup
import sqlalchemy
import lxml

In [481]:
df.to_excel("QQ.xlsx",encoding="utf-8-sig")

In [482]:
d=pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [490]:
# show 出全部的內容
d[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [491]:
from sqlalchemy import create_engine

In [494]:
engine=create_engine("sqlite:///:memory:") #build a sql

In [495]:
df.to_sql("my_table",engine)

In [497]:
sqldf=pd.read_sql("my_table",engine)

In [498]:
sqldf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1